Revit 2024 API
ExportPatternInfo.DestinationPatternName Property
 The destination pattern name (the name of the pattern in the exported format).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public string DestinationPatternName { get; set; }
Visual Basic
Public Property DestinationPatternName As String
	Get
	Set
Visual C++
public:
property String^ DestinationPatternName {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
ExportPatternInfo Class
Autodesk.Revit.DB Namespace